//================================================
//
//制作実践基礎[bg.cpp]
//Author:Kishimoto Eiji
//
//================================================
//***************************
//インクルード
//***************************
#include "bg.h"
#include "application.h"
#include "renderer.h"

#include <assert.h>

//***************************
//定数の定義
//***************************
const float CBg::BG_WIDTH = CRenderer::SCREEN_WIDTH;	//横幅
const float CBg::BG_HEIGHT = CRenderer::SCREEN_HEIGHT;	//縦幅

//================================================
//生成
//================================================
CBg* CBg::Create(CTexture::TEXTURE texture)
{
	CBg* pBg = nullptr;	//ポインタ

	if (pBg != nullptr)
	{//NULLチェック
		assert(false);
	}

	/* nullptrの場合 */

	pBg = new CBg;	//メモリの動的確保

	pBg->Init();	//初期化

	pBg->SetTexture(texture);	//テクスチャの設定

	return pBg;	//動的確保したものを返す
}

//================================================
//コンストラクタ
//================================================
CBg::CBg()
{
	//タイプの設定
	CObject::SetObjType(CObject::OBJ_TYPE::BG);
}

//================================================
//デストラクタ
//================================================
CBg::~CBg()
{
}

//================================================
//初期化
//================================================
HRESULT CBg::Init()
{
	CObject2D::Init();	//親クラス

	//位置を設定
	D3DXVECTOR3 pos = D3DXVECTOR3(0.0f, 0.0f, 0.1f);
	CObject2D::SetPos(pos);

	//サイズを設定
	D3DXVECTOR2 size = D3DXVECTOR2(BG_WIDTH, BG_HEIGHT);
	CObject2D::SetSize(size);

	return S_OK;
}

//================================================
//終了
//================================================
void CBg::Uninit()
{
	CObject2D::Uninit();	//親クラス
}

//================================================
//更新
//================================================
void CBg::Update()
{
	CObject2D::Update();	//親クラス
}

//================================================
//描画
//================================================
void CBg::Draw()
{
	CObject2D::Draw();	//親クラス
}