//================================================
//
//制作実践基礎[bg.cpp]
//Author:Kishimoto Eiji
//
//================================================
//***************************
//インクルード
//***************************
#include "bg.h"
#include "object2D.h"
#include "application.h"
#include "renderer.h"

#include <assert.h>

//***************************
//静的メンバ変数
//***************************
LPDIRECT3DTEXTURE9 CBg::m_apTexture[MAX_OBJECT] = {};	//テクスチャのポインタ

//================================================
//生成
//================================================
CBg* CBg::Create()
{
	CBg* pBg = nullptr;	//ポインタ

	if (pBg != nullptr)
	{//NULLチェック
		assert(false);
	}

	/* nullptrの場合 */

	//pBg = new CBg;	//メモリの動的確保

	pBg->Init();	//初期化

	return pBg;	//動的確保したものを返す
}

//================================================
//コンストラクタ
//================================================
CBg::CBg()
{
	//メンバ変数のクリア
	memset(&m_apTexture[0], 0, sizeof(m_apTexture));
	memset(&m_apObject2D[0], 0, sizeof(m_apObject2D));
}

//================================================
//デストラクタ
//================================================
CBg::~CBg()
{
}

//================================================
//初期化
//================================================
HRESULT CBg::Init()
{
	//テクスチャの設定
	m_apObject2D[0]->SetTexture(CTexture::TEXTURE::TEXTURE_universe);

	return S_OK;
}

//================================================
//終了
//================================================
void CBg::Uninit()
{
	
}

//================================================
//更新
//================================================
void CBg::Update()
{
	
}

//================================================
//描画
//================================================
void CBg::Draw()
{
	
}