//================================================
//
//制作実践基礎[title.cpp]
//Author:Kishimoto Eiji
//
//================================================
//***************************
//インクルード
//***************************
#include "title.h"

#include "input.h"
#include "object2D.h"

#include <assert.h>

//***************************
//定数の定義
//***************************
const float CTitle::START_POS_X = 0.0f;		//初期位置( X )
const float CTitle::START_POS_Y = 150.0f;	//初期位置( Y )
const float CTitle::LOGO_WIDTH = 300.0f;	//ロゴの幅
const float CTitle::LOGO_HEIGHT = 150.0f;	//ロゴの高さ

//***************************
//静的メンバ変数
//***************************
CObject2D* CTitle::m_pLogo = nullptr;	//タイトルロゴ

//================================================
//コンストラクタ
//================================================
CTitle::CTitle()
{
}

//================================================
//デストラクタ
//================================================
CTitle::~CTitle()
{
}

//================================================
//初期化
//================================================
HRESULT CTitle::Init()
{
	//生成
	m_pLogo = CObject2D::Create();

	//位置を設定
	D3DXVECTOR3 pos = D3DXVECTOR3(0.0f, 150.0f, 0.0f);
	m_pLogo->SetPos(pos);

	//サイズを設定
	D3DXVECTOR2 size = D3DXVECTOR2(LOGO_WIDTH, LOGO_HEIGHT);
	m_pLogo->SetSize(size);

	return S_OK;
}

//================================================
//終了
//================================================
void CTitle::Uninit()
{

}

//================================================
//更新
//================================================
void CTitle::Update()
{
	CInput* pInput = CInput::GetKey();	//キーボード情報を取得

	if (pInput->Trigger(CInput::STANDARD_KEY::DECISION))
	{//決定キ―
		SetMode(MODE::GAME);	//モードの設定
	}
}

//================================================
//描画
//================================================
void CTitle::Draw()
{
}